In [16]:
import pandas as pd
file_path = 'onlineshop.csv'
data = pd.read_csv(file_path)

In [17]:
print("5 سطر اول داده‌ها:")
data.head()

5 سطر اول داده‌ها:

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6.0,12/01/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6.0,12/01/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8.0,12/01/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6.0,12/01/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6.0,12/01/10 8:26,3.39,17850.0,United Kingdom

In [18]:
print("\n5 سطر آخر داده‌ها:")
data.tail()

5 سطر آخر داده‌ها:

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
295745,562840,20713,JUMBO BAG OWLS,2.0,08/09/11 16:27,2.08,14527.0,United Kingdom
295746,562840,85099B,JUMBO BAG RED RETROSPOT,2.0,08/09/11 16:27,2.08,14527.0,United Kingdom
295747,562840,23199,JUMBO BAG APPLES,4.0,08/09/11 16:27,2.08,14527.0,United Kingdom
295748,562840,23201,JUMBO BAG ALPHABET,6.0,08/09/11 16:27,2.08,14527.0,United Kingdom
295749,562840,23200,JUMBO BAG,NaN,NaN,NaN,NaN,NaN

In [19]:
print("\nابعاد دیتافریم:")
print(data.shape)

ابعاد دیتافریم:
(295750, 8)

In [20]:
print("\nاطلاعات دیتافریم:")
data.info()

اطلاعات دیتافریم:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 295750 entries, 0 to 295749
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    295750 non-null  object
 1   StockCode    295750 non-null  object
 2   Description  294649 non-null  object
 3   Quantity     295749 non-null  float64
 4   InvoiceDate  295749 non-null  object
 5   UnitPrice    295749 non-null  float64
 6   CustomerID   213009 non-null  float64
 7   Country      295749 non-null  object
dtypes: float64(3), object(5)
memory usage: 18.1+ MB

In [21]:
print("\nمقدار های از دست رفته در هر ستون:")
print(data.isnull().sum())

مقدار های از دست رفته در هر ستون:
InvoiceNo          0
StockCode          0
Description     1101
Quantity           1
InvoiceDate        1
UnitPrice          1
CustomerID     82741
Country            1
dtype: int64

In [22]:
data['Description'] = data['Description'].fillna('توضیحی موجود نیست')

data['Quantity'] = data['Quantity'].fillna(0)

data['UnitPrice'] = data['UnitPrice'].fillna(0)

data['InvoiceDate'] = data['InvoiceDate'].fillna('نامشخص')

data['CustomerID'] = data['CustomerID'].fillna(0)

data = data.dropna(subset=['Country'])

In [23]:
print("\nمقادیر از دست رفته پس از پردازش:")
print(data.isnull().sum())

مقادیر از دست رفته پس از پردازش:
InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [24]:
data['درآمد'] = data['Quantity'] * data['UnitPrice']

print("دیتافریم با ستون درآمد:")
data.head()

دیتافریم با ستون درآمد:

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,درآمد
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6.0,12/01/10 8:26,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6.0,12/01/10 8:26,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8.0,12/01/10 8:26,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6.0,12/01/10 8:26,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6.0,12/01/10 8:26,3.39,17850.0,United Kingdom,20.34

In [25]:
grouped_data = data.groupby('StockCode').agg({'Quantity': 'sum', 'درآمد': 'sum'}).reset_index()

print("\nداده‌های گروه‌بندی شده بر اساس کد محصول:")
grouped_data.head()

داده‌های گروه‌بندی شده بر اساس کد محصول:

  StockCode  Quantity   درآمد
0     10002    1037.0  759.89
1     10080     304.0   53.18
2     10120      88.0   18.48
3    10123C     -13.0    3.25
4    10123G     -38.0    0.00

In [26]:
sorted_data = grouped_data.sort_values(by='Quantity', ascending=False)

print("\nداده‌های مرتب‌شده بر اساس تعداد:")
sorted_data.head()

داده‌های مرتب‌شده بر اساس تعداد:

     StockCode  Quantity     درآمد
2701     84077   34159.0   8316.41
3229    85123A   27759.0  65989.08
3209    85099B   27565.0  53004.53
450      21212   25256.0  14605.49
1143     22197   25090.0  20924.81

In [27]:
top_5_products = sorted_data.head(5)

print("\n5 محصول با بیشترین تعداد فروش:")
top_5_products

5 محصول با بیشترین تعداد فروش:

     StockCode  Quantity     درآمد
2701     84077   34159.0   8316.41
3229    85123A   27759.0  65989.08
3209    85099B   27565.0  53004.53
450      21212   25256.0  14605.49
1143     22197   25090.0  20924.81